Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/monitoring_and_surveillance_at_work/surveillance_of_electronic_communications_in_the_workplace.html.txt.tmx
Source language: en
Languages: ga

source: Surveillance in the workplace
ga: Faireachas sa láthair oibre

source: • Obligations on employers - statement of policy
ga: • Dualgais na bhfostóirí - ráiteas ar bheartais

source: The issue of the use and surveillance of electronic communications and CCTV in the workplace raises important issues regarding data privacy for both the employer and employee
ga: Ardaítear saincheisteanna tábhachtacha maidir le príobháideacht sonraí, áfach, ón úsáid a bhaintear as agus ón bhfaireachán a chuirtear ar chumarsáidí leictreonacha agus TCI sa láthair oibre don fhostóir agus don fhostaí araon

source: These data privacy issues, in particular, affect the surveillance of electronic communications and CCTV at work
ga: Imríonn na saincheisteanna príobháideachta sin tionchar faoi leith ar an bhfaireachán ar úsáid na gcumarsáidí leictreonacha agus TCI sa láthair oibre

source: This document gives an overview of the current rules in place regarding data privacy and surveillance and explains the rights and entitlements of both the employer and employee
ga: Tugtar forbhreathnú sa cháipéis seo ar na rialacha reatha atá i bhfeidhm maidir le príobháideacht sonraí agus maidir le faireachán, agus mínítear ann na cearta agus na teidlíochtaí an fhostóra agus an fhostaí araon

source: While the Data Protection Acts 1988 and 2003 (pdf) set out the rights and entitlements of citizens regarding the issue of data privacy, the issue of surveillance of electronic communications in the workplace is not specifically legislated for
ga: Cé go leagtar amach leis na hAchtanna um Chosaint Sonraí 1988 agus 2003 (pdf) na cearta agus na teidil de chuid saoránaigh maidir le ceist phríobháideacht sonraí, níl aon reachtaíocht shainiúil ann i gcomhar ceist an faireachán ar chumarsáidí leictreonacha sa láthair oibre

source: The European Communities (Electronic Communications Networks and Services) (Data Protection and Privacy) Regulations 2003 (SI 535/2003) introduced provisions relating to the confidentiality of communications
ga: Tugann Rialacháin na gComhphobal Eorpach 2003 (Líonraí agus Seirbhísí na gCumarsáidi Leictreonaí) (Cosaint Sonraí agus an Phríobháideacht) (SI 535/2003) forálacha isteach a bhaineann le rúndacht cumarsáidí

source: However, under Article 29 of the European Directive 95/46/EC, a working group of Data Privacy Commissioners produced a Working Document - WP55 (pdf) on the issue of surveillance of electronic communications in the workplace. The views expressed in the working document are largely in line with the opinions of the Data Protection Commissioner
ga: Faoi Airteagal 29 de Threoir Eorpach 95/46/EC, ámh, chuir grúpa oibre de Choimisinéirí Príobháideachta Sonraí le chéile Cáipéis Oibre WP55 (pdf) ar shaincheist an fhaireacháin ar chumarsáidí leictreonacha sa láthair oibre, Tá an dearcadh a chuirtear in iúl sa cáipéis oibre an-chosúil le tuairimí an Choimisinéara Cosanta Sonraí

source: Privacy in the workplace
ga: Príobháideacht sa láthair oibre

source: While employees have a legitimate expectation of privacy in the workplace, this right must be balanced with the rights and interests of the employer
ga: Cé go mbíonn fostaithe ag dúil go dlisteanach le príobháideacht sa láthair oibre, ní mór an ceart sin a chur i gcóimheá le cearta agus le leasa an fhostóra

source: (In particular, the employer's right to run their business efficiently and above all, to protect themselves from any liability or harm an employee's actions may create.) These rights and interests constitute legitimate grounds that may justify appropriate measures to limit the worker's right to privacy
ga: (Go háirithe ceart an fhostóra a ngnó a reachtáil go heifeachtúil, agus thar aon rud eile, iad féin a chosaint ó aon dliteanas nó ó aon dochar a chruthódh gníomhartha fostaí). Is éard atá sna cearta agus sa leas seo bunúis dhlisteanacha a d’fhéadfadh údar a thabhairt le bearta cuí a chun srian a chur ar cheart an oibrí i leith príobháideachais

source: Examples of these could include:
ga: D’fhéadfaí a áireamh le samplaí díobh seo:

source: • Where the employer is victim of a worker's criminal offence
ga: • Sa chás gurb íospartach de chion coiriúil oibrí an fostóir

source: • Where the employees’ use of social networking sites causes damage to the employer’s business reputation or releases confidential information
ga: • Sa chás go ndéanann an úsáid a bhaineann na fostaithe as láithreáin líonraithe shóisialta díobháil don cháil atá ar ghnó an fhostóra nó go scaoileann an úsáid sin le faisnéis rúnda

source: • Dealing with cyber bullying in the workplace, that is, bullying carried out on the internet and mobile phones, through social networking sites, email and texts
ga: • Déileáil le cibearbhulaíocht san ionad oibre, is é sin, bulaíocht a dhéantar ar an idirlíon agus ar ghutháin phóca, trí láithreáin líonraithe shóisialta, ríomhphoist agus teachtaireachtaí téacs

source: You can read more about bullying in the workplace
ga: Féadfaidh tú tuilleadh a léamh faoi bhulaíocht san ionad oibre anseo

source: However, balancing different rights and interests requires taking a number of principles into account, in particular, proportionality
ga: Ní foláir go dtógfaí roinnt prionsabal i gceist, ámh, nuair a bhítear ag cothromú cearta agus leasa éagsúla; agus ar an gceann is suntasaí díobh sin is í an chomhréireacht

source: It should be clear that the simple fact that a monitoring activity or surveillance is considered convenient to serve the employer's interest would not solely justify any intrusion into a worker's privacy
ga: Ba chóir gurbh shoiléir é nach údar léi féin amháin d'aon chur isteach ar phríobháideacht oibrí í an lomfhíric go meastar gníomhaíocht mhonatóireachta nó faireachán a bheith caoithiúil chun críche leas an fhostóra

source: Obligations on employers - statement of policy
ga: Dualgais na bhfostóirí - ráiteas ar bheartais

source: Employers must provide workers with a readily accessible, clear and accurate statement of policy with regard to email and internet use, including the use of social media, in the workplace
ga: Ní foláir d'fhostóirí ráiteas beartais a sholáthar d’ oibrithe soiléir agus cruinn agus furasta teacht air maidir le ríomhphost agus úsáid an idirlín, úsáid na meáin shóisialta san áireamh, sa láthair oibre

source: This should clearly describe the extent to which the employees can use communication facilities, either owned by the company or personal remote devices such as smartphones, for personal or private communications
ga: Ba cheart go gcuirfí síos go soiléir ann ar an méid leasa a fhéadfaidh fostaithe a bhaint as áiseanna cumarsáide, ar leis an gcomhlacht iad, nó ciangaireas pearsanta, mar shampla, fón cliste, ar mhaithe le cumarsáidí pearsanta nó príobháideacha

source: For example, the policy may place a limitation on the duration and times of use
ga: Mar shampla, d'fhéadfadh an beartas fad agus trátha leasa an chórais a theorannú

source: On the website of the Data Protection Commissioner (DPC) you can find guidance notes on monitoring staff which include the DPC office policy on email and internet use for use as a template
ga: Tá treoirnotaí maidir le monatóireacht an fhoirne lena n-áirítear beartas an oifig ar ríomhphoist agus úsáid an idirlín ar an suiomh gréasáin an Choimisinéara Cosanta Sonraí

source: The working document of the working group of Data Privacy Commissioners recommends that the internet use policy should contain, at the minimum, the following elements:
ga: Moltar i gcáipéis oibre an ghrúpa oibre de chuid na gCoimisinéirí Príobhaideachta Sonraí go mba cheart do na gnéithe seo a leanas, ar a laghad, a bheith arna n-áireamh in aon bheartas ar úsáid an idirlín:

source: • The employer must set out clearly to employees the conditions under which private use of the internet is permitted as well as specifying material that cannot be viewed or copied
ga: • Ní mór don fhostóir na coinníollacha faoina gceadaítear do úsáid príobháideach as an idirlíon a leagan amach go soiléir d'fhostaithe, agus ní mór dóibh an t-ábhar nach féidir breathnú air ná nach féidir a chóipeáil a shonrú chomh maith

source: These conditions and limitations must be explained to employees
ga: Ní mór na coinníollacha agus na teorainneacha seo a mhíniú d'fhostaithe

source: • Employees need to be informed about the systems implemented both to prevent access to certain websites and to detect misuse
ga: • Ba chóir go gcuirfí fostaithe ar an eolas faoi na córais a fheidhmíonn chun rochtain ar láithreáin lín áirithe a chosc agus chun mí-úsáid a bhrath

source: The extent of such monitoring should be specified, for instance, whether such monitoring may relate to individuals or particular sections of the company or whether the content of the websites visited is viewed or recorded by the employer in particular circumstances
ga: Ba chóir go sonrófaí méid na monatóireachta sin; cuir i gcás an mbaineann an mhonatóireacht sin le daoine aonair nó le rannóga faoi leith den chomhlacht?

source: Furthermore, the policy should specify what use, if any, will be made of any data collected in relation to who visited what websites
ga: nó an ndéanan an fostóir taifead ar ábhar na láithreán lín nó an mbreathnaíonn siad ar an ábhar sin in imthosca faoi leith?

source: • Employees should be informed about the involvement of their representatives, (for example, trade union representatives), both in the implementation of the policy and in the investigation of alleged breaches
ga: • Ba chóir go gcuirfí fostaithe ar an eolas faoin mbaint a bhíonn ag a gcuid ionadaithe (mar shampla, ionadaithe ceardchumann) le cur i ngníomh an bheartais agus i bhfiosrú na sáruithe a líomhnaítear

source: If surveillance or monitoring of communications use is to be carried out, the reasons and purposes for which this will be undertaken must be made clear to employees
ga: Dá mba rud é go mbítear chun faireachán nó monatóireacht ar úsáid na gcumarsáidí a chur i gcrích, ní mór go ndéanfaí a shoiléiriú d'fhostaithe na cúiseanna agus na cuspóirí faoina mbítear ag dul ina bhun sin

source: Where an employer has allowed the use of the company's communications facilities for private use by employees, such private communications may be subject to some surveillance, for example, to ensure adequate virus checking
ga: Sa chás ina mbíonn cead tugtha ag fostóir dá fhostaithe úsáid príobháideach a bhaint as áiseanna cumarsáide an chomhlachta, féadfaidh an chumarsáid phríobháideach sin teacht faoi roinnt faireacháin, chun a chinntiú, mar shampla, go mbíonn dóthain seiceála ar bun chun víreasanna a sheachaint

source: Details of surveillance measures to be undertaken must be clearly identified, for example, what type of surveillance and how and when it will be done
ga: Ní foláir sonraí ar bhearta faireacháin a mbeifear ag dul ina mbun a aithint go soiléir, mar shampla: cén cineál faireacháin agus cén chaoi agus cathair a dhéanfar é

source: All these issues should be addressed and included in the employer's policy
ga: Ba cheart go bpleifí na ceisteanna go léir seo agus go n-áireofaí iad i mbeartas an fhostóra

source: In the event of a breach of internal electronic communication use, the employer must have set out enforcement procedures in the company policy
ga: Sa chás go mbíonn sárú ar úsáid inmheánach na cumarsáide leictreonaí, ní mór nósanna imeachta a bheith leagtha amach ag an bhfostóir i mbeartas an chomhlachta

source: In addition, the employer must have clearly set down the opportunities given to employees to respond to breaches of policy
ga: Ina cheann ar sin, ní mór na deiseanna a thabharfaí d'fhostaí freagra a thabhairt ar sháruithe beartais a bheith leagtha síos go soiléir ag an bhfostóir

source: From a practical point of view, it is strongly advised that the employer immediately informs the worker of any misuse of electronic communications that is detected, unless important reasons justify the continuance of the surveillance
ga: Ón taobh praicticiúil de, moltar go tréan é go gcuireann an fostóir an t-oibrí ar an eolas go láithreach i leith aon mhí-úsáide a bhraitear ar chumarsáidí leictreonacha, mura mbíonn cúiseanna tábhachtacha ina n-údar le coinneáil ar an bhfaireachán

source: Employees can be informed through software such as pop-up warning windows
ga: Féadfar fostaithe a chur ar an eolas trí bhogearraí ar nós fuinneoga aníos le foláirimh iontu

source: Before implementing any e-mail monitoring policy in the workplace, employers must ask themselves:
ga: Sula gcuireann siad i bhfeidhm aon bheartas maidir le monatóireacht ríomhphoist sa láthair oibre, ní mór d'fhostóirí na ceisteanna seo a chur orthu féin:

source: • Whether the workers know that the e-mail will be monitored
ga: • An mbeidh a fhios ag na hoibrithe go ndéanfar monatóireacht ar an ríomhphost?

source: • Whether the monitoring is necessary
ga: • An riachtanach í an mhonatóireacht?

source: Could the same results be achieved with traditional methods of supervision?
ga: An bhféadfaí na torthaí céanna a bhaint amach le modhanna traidisiúnta maoirseachta?

source: • Whether the proposed processing of personal data is fair to employees
ga: • An dtugann an phróiseáil ar shonraí pearsanta atá molta cothrom na féinne do na fostaithe?

source: • Whether the monitoring is in proportion to the concerns it tries to address
ga: • An mbíonn an mhonatóireacht i gcomhréir leis na hábhair bhuartha a dtugann sí fúthu?

source: The monitoring of e-mails should, if possible, be limited to traffic data on the participants and time of a communication rather than the contents of communications if this would be sufficient to allay employers concerns. No covert e-mail monitoring is allowed by employers, except in a case where specific criminal activity has been identified and the surveillance is required to obtain evidence and subject to the respect of legal and procedural rules
ga: Ba cheart go mbeadh an mhonatóireacht ar ríomhphoist, más féidir é, teoranta do shonraí tráchta ar na rannpháirtithe agus ar thráth cumarsáide seachas ábhair na cumarsáide féin dá mba leordhóthanach é sin chun amhras an fhostóra a mhaolú.Ní cheadaítear d'fhostóirí aon mhonatóireacht ríomhphoist a dhéanamh faoi cheilt, seachas sna cásanna inar aithníodh gníomaíocht choiriúil a bheith ag tarlú agus bíonn faireachán de dhíth chun fianaise a fháil, agus go dtugtar an meas ceart do rialacha dlíthiúla agus rialacha a bhaineann le nósanna imeachta

source: For example, if the employer or police suspects that an employee is using workplace e-mail and the internet contrary to the provisions of the Child Trafficking and Pornography Act 1998
ga: Mar shampla, más rud é go mbíonn an fostóir nó na póiliní amhrastúil faoi fhostaí a bheith ag baint úsáide as an ríomhphost nó as an idirlíon sa láthair oibre i gcoinne fhorálacha na hAchta um Gháinneáil ar Leanaí agus Pornagrafaíocht Leanaí 1998

source: If access to an e-mail's content is absolutely necessary, the employer should take into account the privacy of people outside the organisation receiving the e-mail as well as those inside
ga: Más bunriachtanas é rochtain a fháil ar ábhar an ríomhphoist, ba cheart go smaoineodh an fostóir faoi phríobháideacht daoine lasmuigh den eagras a fhaigheann ríomhphoist chomh maith leo siúd laistigh den eagras

source: The employer, for instance, cannot obtain the consent of people outside the organisation sending e-mails to its workers
ga: Ní féidir leis an bhfostóir toiliú a fháil ó dhaoine lasmuigh den eagras, cuir i gcás, a sheolann ríomhphoist chuig a oibrithe

source: The employer should make reasonable efforts to inform people outside the organisation of the existence of monitoring activities to the extent that these people could be affected by them
ga: Ba cheart don fhostóir iarracht réasúnta a dhéanamh daoine a chur ar an eolas lasmuigh den eagras faoi ghníomhaíochtaí monatóireachta a bheith ann sa mhéid is gcuirfidís seo isteach ar na daoine sin

source: An example could be the insertion of warning notices regarding the existence of the monitoring systems, which may be added to all outbound e-mails from the organisation
ga: Is sampla í an chaoi go bhféadfaí fógraí foláirimh a chur isteach i ngach ríomhphost a théann amach ón eagras, fógraí a thabharfadh le fios córais mhonatóireachta a bheith ar siúl ag an eagras

source: Any personal data from or related to an employee's e-mail account or his or her use of the internet that is legitimately stored by an employer must be accurate and up to date and not kept for longer than necessary
ga: Aon sonraí pearsanta a thagann ó chuntas ríomhphoist fhostaí nó óna úsáid idirlín, nó a bhaineann leis an gcuntas ríomhphoist sin nó leis an úsáid sin, agus a stórálann fostóir ar bhonn dlisteanach iad, ní mór dóibh a bheith cruinn agus suas chun dáta agus nach gcoinneofaí iad d'achar níos faide ná mar is riachtanach

source: Employers should specify a retention period for e-mails in their central servers based on their business needs and have procedures in place to ensure that retention period is not exceeded
ga: Ba chóir d'fhostóirí tréimhse choimeádta a shonrú do ríomhphoist ina bhfreastalaithe lárnacha, tréimhse a bheadh bunaithe ar a gcuid riachtanas gnó; agus ba cheart go mbeadh nósanna imeachta socraithe acu lena gcinnteofaí nach rachfaí thar an tréimhse choimeádta sin

source: The employer must put in place appropriate technical and organisational measures to ensure that any personal data it holds is secure and safe from outside intrusion
ga: Ní mór don fhostóir bearta iomchuí teicniúla agus eagraíochta a shocrú a chinnteodh go mbeadh aon sonraí pearsanta a bheadh ina seilbh acu daingnithe agus slánaithe ó aon ní a chuirfeadh isteach ón taobh amuigh orthu

source: All usage of CCTV other than in a purely domestic context must be undertaken in compliance with the requirements of data protection legislation
ga: Ní mór go gcomhlíonfaidh gach úsáid a bhaintear as CCTV ceanglais na reachtaíochta um chosaint sonraí, seachas i gcomhthéacs iomlán baile

source: As CCTV infringes the privacy of the persons captured in the images there must be a genuine reason for installing such a system
ga: Mar gheall go sáraíonn CCTV príobháideachas daoine a ghlactar sna híomhánna, ní mór go mbeidh údar dílis ann leis an gcóras sin a shuiteáil

source: If installing such a system, it is required that the purpose for its use be displayed in a prominent position
ga: Má tá córas den sórt sin á shuiteáil agat, ceanglaítear go léirítear cuspóir a úsáide in áit fheiceálach

source: Employers may use CCTV to monitor the workplace for various reasons
ga: Féadfaidh fostóirí CCTV a úsáid chun faireachas a dhéanamh ar an ionad oibre ar mhaithe le cúiseanna éagsúla

source: If CCTV is installed in a workplace, the employer should use signage to inform employees of the location of the cameras and to explain the purpose for which they are installed
ga: Má tá CCTV suiteáilte in ionad oibre, ba cheart don fhostóir comharthaíocht a úsáid chun fostaithe a chur ar an eolas ar láthair na gceamaraí agus chun míniú dóibh céard dó ar suiteáladh iad

source: Under the Data Protection Acts, if your employer informed you that the CCTV cameras were installed to prevent, for example, theft from the workplace, the CCTV footage cannot be used for another purpose such as recording the entry and exit of employees from the workplace
ga: Faoi na hAchtanna um Chosaint Sonraí, má chuir d’fhostóir ar an eolas thú gur suiteáladh ceamaraí CCTV chun gadaíocht ón ionad oibre a chosc, mar shampla, ní féidir na píosaí scannáin CCTV a úsáid ar mhaithe le cúiseanna eile, ar nós iontráil agus fágáil fostaithe ón ionad oibre a thaifeadadh

source: If you feel that your employer’s monitoring and surveillance has breached data protection legislation you may make a complaint to the Data Protection Commissioner – see address below
ga: Má cheapann tú go ndéanann faireachas agus monatóireacht d’fhostóir sárú reachtaíochta cosanta sonraí, is féidir gearáin a dhéanamh leis an gCoimisinéir Cosanta Sonraí – féach seoladh thíos
